---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveElemArcEndAngle
source: html/ad941d83-6bda-8512-3887-0c507d850647.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveElemArcEndAngle Property

"Angle 2"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveElemArcEndAngle { get; }
```